#### Terraform Format and Style 🖌`success`
#### perf - Terraform Initialization ⚙️`success`
#### perf - Terraform Validation 🤖Success! The configuration is valid.


#### perf - Terraform Plan 📖`success`

<details><summary>perf - Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.enable-services.google_project_service.cloudresourcemanager[0]: Refreshing state... [id=broad-jade-perf/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.serviceusage[0]: Refreshing state... [id=broad-jade-perf/serviceusage.googleapis.com]
module.enable-services.google_project_service.required-services[3]: Refreshing state... [id=broad-jade-perf/genomics.googleapis.com]
module.enable-services.google_project_service.required-services[2]: Refreshing state... [id=broad-jade-perf/serviceusage.googleapis.com]
module.enable-services.google_project_service.required-services[14]: Refreshing state... [id=broad-jade-perf/stackdriver.googleapis.com]
module.enable-services.google_project_service.required-services[1]: Refreshing state... [id=broad-jade-perf/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.required-services[8]: Refreshing state... [id=broad-jade-perf/monitoring.googleapis.com]
module.enable-services.google_project_service.required-services[7]: Refreshing state... [id=broad-jade-perf/sql-component.googleapis.com]
module.enable-services.google_project_service.required-services[0]: Refreshing state... [id=broad-jade-perf/iamcredentials.googleapis.com]
module.enable-services.google_project_service.required-services[4]: Refreshing state... [id=broad-jade-perf/compute.googleapis.com]
module.enable-services.google_project_service.required-services[12]: Refreshing state... [id=broad-jade-perf/storage-component.googleapis.com]
module.enable-services.google_project_service.required-services[11]: Refreshing state... [id=broad-jade-perf/storage-api.googleapis.com]
module.enable-services.google_project_service.required-services[15]: Refreshing state... [id=broad-jade-perf/logging.googleapis.com]
module.enable-services.google_project_service.required-services[10]: Refreshing state... [id=broad-jade-perf/container.googleapis.com]
module.enable-services.google_project_service.required-services[6]: Refreshing state... [id=broad-jade-perf/dns.googleapis.com]
module.enable-services.google_project_service.required-services[9]: Refreshing state... [id=broad-jade-perf/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[5]: Refreshing state... [id=broad-jade-perf/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[13]: Refreshing state... [id=broad-jade-perf/servicenetworking.googleapis.com]
module.core-infrastructure.module.k8s-master.data.google_project.project: Refreshing state... [id=projects/broad-jade-perf]
module.core-infrastructure.google_compute_ssl_policy.global-ssl-policy: Refreshing state... [id=projects/broad-jade-perf/global/sslPolicies/global-ssl-policy]
module.core-infrastructure.google_compute_address.nat-address[1]: Refreshing state... [id=projects/broad-jade-perf/regions/us-central1/addresses/nat-external-1]
module.core-infrastructure.google_dns_managed_zone.dns_zone[0]: Refreshing state... [id=projects/broad-jade-perf/managedZones/datarepo-perf]
module.core-infrastructure.module.k8s-master.data.google_container_engine_versions.cluster_versions: Refreshing state... [id=2021-01-07 21:19:41.578469492 +0000 UTC]
module.core-infrastructure.google_compute_address.nat-address[0]: Refreshing state... [id=projects/broad-jade-perf/regions/us-central1/addresses/nat-external-0]
module.core-infrastructure.google_compute_network.network[0]: Refreshing state... [id=projects/broad-jade-perf/global/networks/perf-network]
module.core-infrastructure.module.cloud-armor.google_compute_security_policy.policy: Refreshing state... [id=projects/broad-jade-perf/global/securityPolicies/broad-cloud-armor]
module.core-infrastructure.google_compute_subnetwork.subnetwork[0]: Refreshing state... [id=projects/broad-jade-perf/regions/us-central1/subnetworks/perf-subnet]
module.core-infrastructure.google_compute_router.router[0]: Refreshing state... [id=projects/broad-jade-perf/regions/us-central1/routers/router]
module.core-infrastructure.module.k8s-master.google_container_cluster.cluster: Refreshing state... [id=projects/broad-jade-perf/locations/us-central1/clusters/jade-master-us-central1]
module.core-infrastructure.google_compute_router_nat.nat[0]: Refreshing state... [id=broad-jade-perf/us-central1/router/nat-1]
module.core-infrastructure.module.k8s-nodes["jade-node-us-central-1"].google_container_node_pool.pool: Refreshing state... [id=projects/broad-jade-perf/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-1]
module.datarepo-app.data.google_dns_managed_zone.dns_zone[0]: Refreshing state... [id=projects/broad-jade-perf/managedZones/datarepo-perf]
module.datarepo-app.module.workloadid.google_service_account.user-sql-service-account["perf"]: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/perf-workload-proxy-sa@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_service_account.datarepo_api_sa[0]: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo"]: Refreshing state... [id=aNMSBLCABzYH2zvi4gyTig]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo-stairway"]: Refreshing state... [id=j1pP7_dXMAel-yE6ppQsGg]
module.datarepo-app.module.cloudsql.random_id.cloudsql_id[0]: Refreshing state... [id=nYzXs8nUU2U]
module.datarepo-app.module.cloudsql.random_id.root_user_password[0]: Refreshing state... [id=XVBZlc9f-z80-ZpLNO5jsw]
module.datarepo-app.google_service_account.datarepo_sql_sa[0]: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/datarepo-jade-sql@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_compute_global_address.global_ip_address: Refreshing state... [id=projects/broad-jade-perf/global/addresses/jade-perf-ip]
module.datarepo-app.module.cloudsql.google_compute_global_address.private_ip_address[0]: Refreshing state... [id=projects/broad-jade-perf/global/addresses/datarepo-db-jade-private-address]
module.datarepo-app.google_service_account.datarepo_test_runner_sa[0]: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/datarepo-jade-test-runner@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.google_service_networking_connection.private_vpc_connection[0]: Refreshing state... [id=https%3A%2F%2Fwww.googleapis.com%2Fcompute%2Fv1%2Fprojects%2Fbroad-jade-perf%2Fglobal%2Fnetworks%2Fperf-network:servicenetworking.googleapis.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[1]: Refreshing state... [id=broad-jade-perf/roles/logging.viewer/serviceaccount:datarepo-jade-test-runner@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[0]: Refreshing state... [id=broad-jade-perf/roles/container.admin/serviceaccount:datarepo-jade-test-runner@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.sql_sa_key[0]: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/datarepo-jade-sql@broad-jade-perf.iam.gserviceaccount.com/keys/240dd95a7dfefef3508baddc876fb0eb4fc85078]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[3]: Refreshing state... [id=broad-jade-perf/roles/secretmanager.admin/serviceaccount:datarepo-jade-test-runner@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[2]: Refreshing state... [id=broad-jade-perf/roles/monitoring.viewer/serviceaccount:datarepo-jade-test-runner@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.test_runner_sa_key[0]: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/datarepo-jade-test-runner@broad-jade-perf.iam.gserviceaccount.com/keys/dc9c1cafa59b58166045e973d2e791b8a3f4dde7]
module.datarepo-app.google_service_account_key.api_sa_key[0]: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com/keys/89af255c61dee30f0a6f1c490beace331479f1aa]
module.datarepo-app.google_project_iam_member.sql_sa_role[0]: Refreshing state... [id=broad-jade-perf/roles/cloudsql.client/serviceaccount:datarepo-jade-sql@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_dns_record_set.a_dns[0]: Refreshing state... [id=datarepo-perf/jade-perf-global.datarepo-perf.broadinstitute.org./A]
module.datarepo-app.google_project_iam_member.api_sa_role[9]: Refreshing state... [id=broad-jade-perf/roles/pubsub.admin/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[10]: Refreshing state... [id=broad-jade-perf/roles/container.admin/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[11]: Refreshing state... [id=broad-jade-perf/roles/resourcemanager.projectIamAdmin/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[3]: Refreshing state... [id=broad-jade-perf/roles/errorreporting.writer/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[6]: Refreshing state... [id=broad-jade-perf/roles/servicemanagement.serviceController/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[7]: Refreshing state... [id=broad-jade-perf/roles/stackdriver.accounts.viewer/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.module.workloadid.google_service_account_key.user-sql-sa-key["perf"]: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/perf-workload-proxy-sa@broad-jade-perf.iam.gserviceaccount.com/keys/416a26c293ae1f6e058593d4da5e7541f08f9193]
module.datarepo-app.google_project_iam_member.api_sa_role[8]: Refreshing state... [id=broad-jade-perf/roles/storage.admin/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[0]: Refreshing state... [id=broad-jade-perf/roles/bigquery.admin/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[2]: Refreshing state... [id=broad-jade-perf/roles/datastore.user/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[1]: Refreshing state... [id=broad-jade-perf/roles/cloudsql.admin/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[4]: Refreshing state... [id=broad-jade-perf/roles/logging.logWriter/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[5]: Refreshing state... [id=broad-jade-perf/roles/monitoring.admin/serviceaccount:datarepo-jade-api@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.module.workloadid.google_service_account_iam_binding.sqlproxy_workload_identity_binding["perf"]: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/perf-workload-proxy-sa@broad-jade-perf.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-app.module.workloadid.google_project_iam_member.user-sql-sa-role["perf"]: Refreshing state... [id=broad-jade-perf/roles/cloudsql.client/serviceaccount:perf-workload-proxy-sa@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-app.vault_generic_secret.test_runner_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/perf/test-runner-sa]
module.datarepo-app.vault_generic_secret.api_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/perf/datarepo-api-sa]
module.datarepo-app.vault_generic_secret.sql_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/perf/datarepo-sql-sa]
module.datarepo-app.google_dns_record_set.cname_dns[0]: Refreshing state... [id=datarepo-perf/jade-perf.datarepo-perf.broadinstitute.org./CNAME]
module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0]: Refreshing state... [id=datarepo-db-jade-9d8cd7b3c9d45365]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo-stairway"]: Refreshing state... [id=drmanager//datarepo-db-jade-9d8cd7b3c9d45365]
module.datarepo-app.module.cloudsql.google_sql_user.root_user[0]: Refreshing state... [id=root//datarepo-db-jade-9d8cd7b3c9d45365]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo"]: Refreshing state... [id=drmanager//datarepo-db-jade-9d8cd7b3c9d45365]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo"]: Refreshing state... [id=projects/broad-jade-perf/instances/datarepo-db-jade-9d8cd7b3c9d45365/databases/datarepo]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo-stairway"]: Refreshing state... [id=projects/broad-jade-perf/instances/datarepo-db-jade-9d8cd7b3c9d45365/databases/stairway]
module.datarepo-app.vault_generic_secret.sql_db_password[0]: Refreshing state... [id=secret/dsde/datarepo/perf/datarepo-sql-db]
module.datarepo-alerts.data.vault_generic_secret.slack_token: Refreshing state... [id=secret/suitable/terraform/stackdriver/slack-token]
module.datarepo-alerts.data.google_dns_managed_zone.dns_zone[0]: Refreshing state... [id=projects/broad-jade-perf/managedZones/datarepo-perf]
module.datarepo-alerts.module.uptimecheck.google_monitoring_uptime_check_config.uptime-check-config[0]: Refreshing state... [id=projects/broad-jade-perf/uptimeCheckConfigs/jade-perf-datarepo-perf-broadinstitute-org]
module.datarepo-alerts.google_compute_global_address.global_ip_address_grafana: Refreshing state... [id=projects/broad-jade-perf/global/addresses/datarepo-grafana-ip]
module.datarepo-alerts.google_compute_global_address.global_ip_address_prometheus: Refreshing state... [id=projects/broad-jade-perf/global/addresses/datarepo-prometheus-ip]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account.service-account: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/prometheus-sa@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0]: Refreshing state... [id=projects/broad-jade-perf/notificationChannels/3869773518729165502]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.admin"]: Refreshing state... [id=broad-jade-perf/roles/monitoring.admin/serviceaccount:prometheus-sa@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.metricWriter"]: Refreshing state... [id=broad-jade-perf/roles/monitoring.metricWriter/serviceaccount:prometheus-sa@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_key.service-account-key: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/prometheus-sa@broad-jade-perf.iam.gserviceaccount.com/keys/a5d53533f84d01a29e83a8a7d825eb41e5881b9d]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_iam_binding.workload-identity-binding: Refreshing state... [id=projects/broad-jade-perf/serviceAccounts/prometheus-sa@broad-jade-perf.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/logging.admin"]: Refreshing state... [id=broad-jade-perf/roles/logging.admin/serviceaccount:prometheus-sa@broad-jade-perf.iam.gserviceaccount.com]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.node_resource_alerts: Refreshing state... [id=projects/broad-jade-perf/alertPolicies/3837205474008382607]
module.datarepo-alerts.google_dns_record_set.grafana_a_dns[0]: Refreshing state... [id=datarepo-perf/datarepo-grafana.datarepo-perf.broadinstitute.org./A]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_memory_util: Refreshing state... [id=projects/broad-jade-perf/alertPolicies/1124096916984786439]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_health_alert: Refreshing state... [id=projects/broad-jade-perf/alertPolicies/18153599214970417824]
module.datarepo-alerts.google_dns_record_set.prometheus_a_dns[0]: Refreshing state... [id=datarepo-perf/datarepo-prometheus.datarepo-perf.broadinstitute.org./A]
module.datarepo-alerts.module.uptimecheck.google_monitoring_alert_policy.uptime-check[0]: Refreshing state... [id=projects/broad-jade-perf/alertPolicies/2707639561392074623]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.datarepo-alerts.data.google_dns_managed_zone.dns_zone[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_dns_managed_zone" "dns_zone"  {
      ~ description  = "Managed by Terraform" -> (known after apply)
      ~ dns_name     = "datarepo-perf.broadinstitute.org." -> (known after apply)
      ~ id           = "projects/broad-jade-perf/managedZones/datarepo-perf" -> (known after apply)
        name         = "datarepo-perf"
      ~ name_servers = [
          - "ns-cloud-b1.googledomains.com.",
          - "ns-cloud-b2.googledomains.com.",
          - "ns-cloud-b3.googledomains.com.",
          - "ns-cloud-b4.googledomains.com.",
        ] -> (known after apply)
      - project      = "broad-jade-perf" -> null
      ~ visibility   = "public" -> (known after apply)
    }

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      ~ data             = (sensitive value)
      ~ data_json        = (sensitive value)
      ~ id               = "secret/suitable/terraform/stackdriver/slack-token" -> (known after apply)
      ~ lease_duration   = 2764800 -> (known after apply)
      + lease_id         = (known after apply)
      ~ lease_renewable  = false -> (known after apply)
      ~ lease_start_time = "RFC7779" -> (known after apply)
        path             = "secret/suitable/terraform/stackdriver/slack-token"
      - version          = -1 -> null
    }

  # module.datarepo-alerts.google_dns_record_set.grafana_a_dns[0] must be replaced
-/+ resource "google_dns_record_set" "grafana_a_dns" {
      ~ id           = "datarepo-perf/datarepo-grafana.datarepo-perf.broadinstitute.org./A" -> (known after apply)
        managed_zone = "datarepo-perf"
      ~ name         = "datarepo-grafana.datarepo-perf.broadinstitute.org." -> (known after apply) # forces replacement
      ~ project      = "broad-jade-perf" -> (known after apply)
        rrdatas      = [
            "34.98.114.37",
        ]
        ttl          = 300
        type         = "A"
    }

  # module.datarepo-alerts.google_dns_record_set.prometheus_a_dns[0] must be replaced
-/+ resource "google_dns_record_set" "prometheus_a_dns" {
      ~ id           = "datarepo-perf/datarepo-prometheus.datarepo-perf.broadinstitute.org./A" -> (known after apply)
        managed_zone = "datarepo-perf"
      ~ name         = "datarepo-prometheus.datarepo-perf.broadinstitute.org." -> (known after apply) # forces replacement
      ~ project      = "broad-jade-perf" -> (known after apply)
        rrdatas      = [
            "34.120.79.15",
        ]
        ttl          = 300
        type         = "A"
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "notification_channel" {
        display_name = "perf"
        enabled      = true
        id           = "projects/broad-jade-perf/notificationChannels/3869773518729165502"
      ~ labels       = {
          - "auth_token"   = "xoxb-12729891575-1301495169890-SUYNuZWXKWTdFGkT4W07MfGg"
          - "channel_name" = "#jade-alerts"
        } -> (known after apply)
        name         = "projects/broad-jade-perf/notificationChannels/3869773518729165502"
        project      = "broad-jade-perf"
        type         = "slack"
        user_labels  = {}
    }

  # module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0] will be updated in-place
  ~ resource "google_sql_database_instance" "cloudsql_instance" {
        connection_name               = "broad-jade-perf:us-central1:datarepo-db-jade-9d8cd7b3c9d45365"
        database_version              = "POSTGRES_11"
        deletion_protection           = true
        first_ip_address              = "10.23.0.2"
        id                            = "datarepo-db-jade-9d8cd7b3c9d45365"
        ip_address                    = [
            {
                ip_address     = "10.23.0.2"
                time_to_retire = ""
                type           = "PRIVATE"
            },
        ]
        name                          = "datarepo-db-jade-9d8cd7b3c9d45365"
        private_ip_address            = "10.23.0.2"
        project                       = "broad-jade-perf"
        region                        = "us-central1"
        self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/broad-jade-perf/instances/datarepo-db-jade-9d8cd7b3c9d45365"
        server_ca_cert                = [
            {
                cert             = <<~EOT
                    -----BEGIN CERTIFICATE-----
                    MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQzOGZj
                    YTYyNy0wNzkwLTQzZDYtYjM1ZC01OTNiNGMwMjJjNTQxIzAhBgNVBAMTGkdvb2ds
                    ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
                    A1UEBhMCVVMwHhcNMjAwNjI2MTcyNjUyWhcNMzAwNjI0MTcyNzUyWjB3MS0wKwYD
                    VQQuEyQzOGZjYTYyNy0wNzkwLTQzZDYtYjM1ZC01OTNiNGMwMjJjNTQxIzAhBgNV
                    BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
                    IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
                    AQCX8MjR1dJxW9HhyKNdXwuymuA7XzXHzkbFd5j8s4zazYjGCgiwC+ebbEpDR3KR
                    /9cmAhbeSA7Ro9LHilnaGJis0cU0ExLie82an7dzwYP/nDKZtD9LD8B3hhtraXSy
                    KeUA4i1Jqr9r5QcA2aiDk7pqcag6WriDJ2VhB73ZrXBLa6/A1nvBhYdpilxxqzd0
                    jWOOC0t6xiKjmFumhKdUppJnrtxSSZZj09ks4Ai1VV3G8iJJg7e0VEpQIFbD2Z96
                    xTDlbrUBRbCrRfN6dmM3prP90rFalVzpzPFHX2G9Ke5zDoHX8QmMl9VZWgcUg74+
                    38dbQcb28j69UbprotM/+sy1AgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
                    DQYJKoZIhvcNAQELBQADggEBAAgt+qG7N3gZi19gp/rUWzA2DSpa3LUIOrgzFx5v
                    r051IoBHuh2mbDHdtj80vYHRegR6D2c+49XUSE/oLFxsZGCM0bgBpnVvJZOlIJos
                    gzJBGRg7F3RYFpGAfBRNYeZzBzqC6EReuQne6kAgEt87s9vtAXf4srcMO58T9bN2
                    eWzbQUtDQN9a4yjCBGhq+u2BI5tqo0PtRV32mADa5KEFDT+t5x1KXkLs+NJA19u2
                    1jvxEP80kc+42BhITWebwdImXVVzYgqsQQf+O3osRooogCEtmaEGVHGgHebzsW3q
                    79nAWA4uUyiBaRALrvzLNX0rGYs2g+ETAgcFc+urdGKMGXM=
                    -----END CERTIFICATE-----
                EOT
                common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=38fca627-0790-43d6-b35d-593b4c022c54"
                create_time      = "2020-06-26T17:26:52.496Z"
                expiration_time  = "2030-06-24T17:27:52.496Z"
                sha1_fingerprint = "eefe2b7775a7eb166370574ddffa4b1819cb40d1"
            },
        ]
        service_account_email_address = "p316927583106-khzw1o@gcp-sa-cloud-sql.iam.gserviceaccount.com"

      ~ settings {
            activation_policy           = "ALWAYS"
            authorized_gae_applications = []
            availability_type           = "REGIONAL"
            crash_safe_replication      = false
            disk_autoresize             = true
            disk_size                   = 10
            disk_type                   = "PD_SSD"
            pricing_plan                = "PER_USE"
          + replication_type            = "SYNCHRONOUS"
            tier                        = "db-custom-16-32768"
            user_labels                 = {
                "app" = "datarepo"
                "env" = "jade"
            }
            version                     = 47

            backup_configuration {
                binary_log_enabled             = false
                enabled                        = true
                point_in_time_recovery_enabled = false
                start_time                     = "06:00"
            }

            database_flags {
                name  = "max_connections"
                value = "200"
            }

            ip_configuration {
                ipv4_enabled    = false
                private_network = "projects/broad-jade-perf/global/networks/perf-network"
                require_ssl     = true
            }

            location_preference {
                zone = "us-central1-a"
            }
        }
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Warning: Interpolation-only expressions are deprecated

  on modules/datarepo-app/cloudsql.tf line 24, in module "cloudsql":
  24:     "${local.service}" = {

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 2 more similar warnings elsewhere)


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @smark88, Action: `pull_request`, Working Directory: `./datarepo`, Workflow: `Terraform Plan`*